# Pandas DataFrame: Mengelola Data dalam Bentuk Tabel

Pandas DataFrame adalah salah satu struktur data paling penting yang ditawarkan oleh pustaka Pandas. Ini merupakan struktur data dua dimensi yang mirip dengan tabel dalam database atau lembar kerja Excel. DataFrame memungkinkan kita untuk menyimpan, mengelola, dan menganalisis data dalam bentuk yang lebih terstruktur dan mudah dimengerti. Mari kita lihat bagaimana bekerja dengan Pandas DataFrame.

In [3]:
import pandas as pd
# Membuat dictionary dengan data
data = {
    'Nama': ['Alice', 'Bob', 'Charlie', 'David'],
    'Usia': [25, 30, 22, 28],
    'Pekerjaan': ['Pengembang', 'Analisis Data', 'Desainer', 'Manajer']
}

# Membuat DataFrame dari dictionary
df = pd.DataFrame(data)
df

      Nama  Usia      Pekerjaan
0    Alice    25     Pengembang
1      Bob    30  Analisis Data
2  Charlie    22       Desainer
3    David    28        Manajer

In [5]:
# Mengakses baris pertama (indeks 0)
first_row = df.loc[0]
first_row

Nama              Alice
Usia                 25
Pekerjaan    Pengembang
Name: 0, dtype: object

In [6]:
# Mengakses kolom 'Nama'
names = df['Nama']
names

0      Alice
1        Bob
2    Charlie
3      David
Name: Nama, dtype: object

In [7]:
# Mengakses data pada baris ke-2 dan kolom 'Usia'
age_of_second_person = df.at[1, 'Usia']
age_of_second_person

30

In [8]:
# Mengambil baris dengan usia di atas 25
above_25 = df[df['Usia'] > 25]
above_25

    Nama  Usia      Pekerjaan
1    Bob    30  Analisis Data
3  David    28        Manajer

In [9]:
# Menghitung rata-rata usia
average_age = df['Usia'].mean()
average_age

26.25

In [10]:
# Menyimpan DataFrame ke file CSV
df.to_csv('data.csv', index=False)

In [12]:
# Memuat DataFrame dari file CSV
loaded_df = pd.read_csv('data.csv')
loaded_df

      Nama  Usia      Pekerjaan
0    Alice    25     Pengembang
1      Bob    30  Analisis Data
2  Charlie    22       Desainer
3    David    28        Manajer